test-stress-results/k6-stress-golang-health-results.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: /stress.js
     output: -

  scenarios: (100.00%) 1 scenario, 30 max VUs, 3m0s max duration (incl. graceful stop):
           * default: Up to 30 looping VUs for 2m30s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/30 VUs, 9 complete and 0 interrupted iterations
default   [   1% ] 01/30 VUs  0m01.0s/2m30.0s

running (0m02.0s), 01/30 VUs, 18 complete and 0 interrupted iterations
default   [   1% ] 01/30 VUs  0m02.0s/2m30.0s

running (0m02.9s), 01/30 VUs, 28 complete and 0 interrupted iterations
default   [   2% ] 01/30 VUs  0m03.0s/2m30.0s

running (0m04.0s), 02/30 VUs, 44 complete and 0 interrupted iterations
default   [   3% ] 02/30 VUs  0m04.0s/2m30.0s

running (0m04.9s), 02/30 VUs, 62 complete and 0 interrupted iterations
default   [   3% ] 02/30 VUs  0m05.0s/2m30.0s

running (0m05.9s), 02/30 VUs, 82 complete and 0 interrupted iterations
default   [   4% ] 02/30 VUs  0m06.0s/2m30.0s

running (0m06.9s), 03/30 VUs, 105 complete and 0 interrupted iterations
default   [   5% ] 03/30 VUs  0m07.0s/2m30.0s

running (0m07.9s), 03/30 VUs, 132 complete and 0 interrupted iterations
default   [   5% ] 03/30 VUs  0m08.0s/2m30.0s

running (0m09.0s), 03/30 VUs, 162 complete and 0 interrupted iterations
default   [   6% ] 03/30 VUs  0m09.0s/2m30.0s

running (0m09.9s), 03/30 VUs, 191 complete and 0 interrupted iterations
default   [   7% ] 03/30 VUs  0m10.0s/2m30.0s

running (0m10.9s), 04/30 VUs, 228 complete and 0 interrupted iterations
default   [   7% ] 04/30 VUs  0m11.0s/2m30.0s

running (0m11.9s), 04/30 VUs, 266 complete and 0 interrupted iterations
default   [   8% ] 04/30 VUs  0m12.0s/2m30.0s

running (0m13.0s), 04/30 VUs, 305 complete and 0 interrupted iterations
default   [   9% ] 04/30 VUs  0m13.0s/2m30.0s

running (0m14.0s), 05/30 VUs, 350 complete and 0 interrupted iterations
default   [   9% ] 05/30 VUs  0m14.0s/2m30.0s

running (0m14.9s), 05/30 VUs, 396 complete and 0 interrupted iterations
default   [  10% ] 05/30 VUs  0m15.0s/2m30.0s

running (0m15.9s), 05/30 VUs, 446 complete and 0 interrupted iterations
default   [  11% ] 05/30 VUs  0m16.0s/2m30.0s

running (0m17.0s), 06/30 VUs, 498 complete and 0 interrupted iterations
default   [  11% ] 06/30 VUs  0m17.0s/2m30.0s

running (0m18.0s), 06/30 VUs, 552 complete and 0 interrupted iterations
default   [  12% ] 06/30 VUs  0m18.0s/2m30.0s

running (0m19.0s), 06/30 VUs, 612 complete and 0 interrupted iterations
default   [  13% ] 06/30 VUs  0m19.0s/2m30.0s

running (0m19.9s), 06/30 VUs, 667 complete and 0 interrupted iterations
default   [  13% ] 06/30 VUs  0m20.0s/2m30.0s

running (0m20.9s), 07/30 VUs, 735 complete and 0 interrupted iterations
default   [  14% ] 07/30 VUs  0m21.0s/2m30.0s

running (0m21.9s), 07/30 VUs, 799 complete and 0 interrupted iterations
default   [  15% ] 07/30 VUs  0m22.0s/2m30.0s

running (0m22.9s), 07/30 VUs, 868 complete and 0 interrupted iterations
default   [  15% ] 07/30 VUs  0m23.0s/2m30.0s

running (0m24.0s), 08/30 VUs, 933 complete and 0 interrupted iterations
default   [  16% ] 08/30 VUs  0m24.0s/2m30.0s

running (0m24.9s), 08/30 VUs, 1005 complete and 0 interrupted iterations
default   [  17% ] 08/30 VUs  0m25.0s/2m30.0s

running (0m25.9s), 08/30 VUs, 1083 complete and 0 interrupted iterations
default   [  17% ] 08/30 VUs  0m26.0s/2m30.0s

running (0m26.9s), 09/30 VUs, 1166 complete and 0 interrupted iterations
default   [  18% ] 09/30 VUs  0m27.0s/2m30.0s

running (0m27.9s), 09/30 VUs, 1249 complete and 0 interrupted iterations
default   [  19% ] 09/30 VUs  0m28.0s/2m30.0s

running (0m29.0s), 09/30 VUs, 1334 complete and 0 interrupted iterations
default   [  19% ] 09/30 VUs  0m29.0s/2m30.0s

running (0m30.0s), 09/30 VUs, 1419 complete and 0 interrupted iterations
default   [  20% ] 09/30 VUs  0m30.0s/2m30.0s

running (0m31.0s), 10/30 VUs, 1493 complete and 0 interrupted iterations
default   [  21% ] 10/30 VUs  0m31.0s/2m30.0s

running (0m32.0s), 10/30 VUs, 1576 complete and 0 interrupted iterations
default   [  21% ] 10/30 VUs  0m32.0s/2m30.0s

running (0m33.0s), 10/30 VUs, 1641 complete and 0 interrupted iterations
default   [  22% ] 10/30 VUs  0m33.0s/2m30.0s

running (0m33.9s), 11/30 VUs, 1737 complete and 0 interrupted iterations
default   [  23% ] 11/30 VUs  0m34.0s/2m30.0s

running (0m34.9s), 11/30 VUs, 1823 complete and 0 interrupted iterations
default   [  23% ] 11/30 VUs  0m35.0s/2m30.0s

running (0m35.9s), 11/30 VUs, 1933 complete and 0 interrupted iterations
default   [  24% ] 11/30 VUs  0m36.0s/2m30.0s

running (0m36.9s), 12/30 VUs, 2041 complete and 0 interrupted iterations
default   [  25% ] 12/30 VUs  0m37.0s/2m30.0s

running (0m37.9s), 12/30 VUs, 2149 complete and 0 interrupted iterations
default   [  25% ] 12/30 VUs  0m38.0s/2m30.0s

running (0m38.9s), 12/30 VUs, 2231 complete and 0 interrupted iterations
default   [  26% ] 12/30 VUs  0m39.0s/2m30.0s

running (0m39.9s), 13/30 VUs, 2323 complete and 0 interrupted iterations
default   [  27% ] 13/30 VUs  0m40.0s/2m30.0s

running (0m40.9s), 13/30 VUs, 2434 complete and 0 interrupted iterations
default   [  27% ] 13/30 VUs  0m41.0s/2m30.0s

running (0m41.9s), 13/30 VUs, 2507 complete and 0 interrupted iterations
default   [  28% ] 13/30 VUs  0m42.0s/2m30.0s

running (0m42.9s), 14/30 VUs, 2593 complete and 0 interrupted iterations
default   [  29% ] 14/30 VUs  0m43.0s/2m30.0s

running (0m43.9s), 14/30 VUs, 2695 complete and 0 interrupted iterations
default   [  29% ] 14/30 VUs  0m44.0s/2m30.0s

running (0m44.9s), 14/30 VUs, 2783 complete and 0 interrupted iterations
default   [  30% ] 14/30 VUs  0m45.0s/2m30.0s

running (0m45.9s), 15/30 VUs, 2886 complete and 0 interrupted iterations
default   [  31% ] 15/30 VUs  0m46.0s/2m30.0s

running (0m46.9s), 15/30 VUs, 2970 complete and 0 interrupted iterations
default   [  31% ] 15/30 VUs  0m47.0s/2m30.0s

running (0m47.9s), 15/30 VUs, 3091 complete and 0 interrupted iterations
default   [  32% ] 15/30 VUs  0m48.0s/2m30.0s

running (0m48.9s), 16/30 VUs, 3179 complete and 0 interrupted iterations
default   [  33% ] 16/30 VUs  0m49.0s/2m30.0s

running (0m49.9s), 16/30 VUs, 3263 complete and 0 interrupted iterations
default   [  33% ] 16/30 VUs  0m50.0s/2m30.0s

running (0m50.9s), 16/30 VUs, 3375 complete and 0 interrupted iterations
default   [  34% ] 16/30 VUs  0m51.0s/2m30.0s

running (0m51.9s), 17/30 VUs, 3507 complete and 0 interrupted iterations
default   [  35% ] 17/30 VUs  0m52.0s/2m30.0s

running (0m52.9s), 17/30 VUs, 3607 complete and 0 interrupted iterations
default   [  35% ] 17/30 VUs  0m53.0s/2m30.0s

running (0m53.9s), 17/30 VUs, 3708 complete and 0 interrupted iterations
default   [  36% ] 17/30 VUs  0m54.0s/2m30.0s

running (0m54.9s), 18/30 VUs, 3819 complete and 0 interrupted iterations
default   [  37% ] 18/30 VUs  0m55.0s/2m30.0s

running (0m55.9s), 18/30 VUs, 3932 complete and 0 interrupted iterations
default   [  37% ] 18/30 VUs  0m56.0s/2m30.0s

running (0m56.9s), 18/30 VUs, 4008 complete and 0 interrupted iterations
default   [  38% ] 18/30 VUs  0m57.0s/2m30.0s

running (0m57.9s), 19/30 VUs, 4112 complete and 0 interrupted iterations
default   [  39% ] 19/30 VUs  0m58.0s/2m30.0s

running (0m58.9s), 19/30 VUs, 4226 complete and 0 interrupted iterations
default   [  39% ] 19/30 VUs  0m59.0s/2m30.0s

running (0m59.9s), 19/30 VUs, 4321 complete and 0 interrupted iterations
default   [  40% ] 19/30 VUs  1m00.0s/2m30.0s

running (1m00.9s), 20/30 VUs, 4409 complete and 0 interrupted iterations
default   [  41% ] 20/30 VUs  1m01.0s/2m30.0s

running (1m01.9s), 20/30 VUs, 4497 complete and 0 interrupted iterations
default   [  41% ] 20/30 VUs  1m02.0s/2m30.0s

running (1m02.9s), 20/30 VUs, 4558 complete and 0 interrupted iterations
default   [  42% ] 20/30 VUs  1m03.0s/2m30.0s

running (1m03.9s), 20/30 VUs, 4680 complete and 0 interrupted iterations
default   [  43% ] 20/30 VUs  1m04.0s/2m30.0s

running (1m04.9s), 20/30 VUs, 4800 complete and 0 interrupted iterations
default   [  43% ] 20/30 VUs  1m05.0s/2m30.0s

running (1m05.9s), 20/30 VUs, 4848 complete and 0 interrupted iterations
default   [  44% ] 20/30 VUs  1m06.0s/2m30.0s

running (1m06.9s), 21/30 VUs, 4921 complete and 0 interrupted iterations
default   [  45% ] 21/30 VUs  1m07.0s/2m30.0s

running (1m07.9s), 21/30 VUs, 4996 complete and 0 interrupted iterations
default   [  45% ] 21/30 VUs  1m08.0s/2m30.0s

running (1m08.9s), 21/30 VUs, 5090 complete and 0 interrupted iterations
default   [  46% ] 21/30 VUs  1m09.0s/2m30.0s

running (1m09.9s), 21/30 VUs, 5167 complete and 0 interrupted iterations
default   [  47% ] 21/30 VUs  1m10.0s/2m30.0s

running (1m10.9s), 21/30 VUs, 5232 complete and 0 interrupted iterations
default   [  47% ] 21/30 VUs  1m11.0s/2m30.0s

running (1m11.9s), 21/30 VUs, 5328 complete and 0 interrupted iterations
default   [  48% ] 21/30 VUs  1m12.0s/2m30.0s

running (1m12.9s), 22/30 VUs, 5416 complete and 0 interrupted iterations
default   [  49% ] 22/30 VUs  1m13.0s/2m30.0s

running (1m13.9s), 22/30 VUs, 5542 complete and 0 interrupted iterations
default   [  49% ] 22/30 VUs  1m14.0s/2m30.0s

running (1m14.9s), 22/30 VUs, 5641 complete and 0 interrupted iterations
default   [  50% ] 22/30 VUs  1m15.0s/2m30.0s

running (1m15.9s), 22/30 VUs, 5720 complete and 0 interrupted iterations
default   [  51% ] 22/30 VUs  1m16.0s/2m30.0s

running (1m16.9s), 22/30 VUs, 5807 complete and 0 interrupted iterations
default   [  51% ] 22/30 VUs  1m17.0s/2m30.0s

running (1m17.9s), 22/30 VUs, 5912 complete and 0 interrupted iterations
default   [  52% ] 22/30 VUs  1m18.0s/2m30.0s

running (1m18.9s), 23/30 VUs, 6011 complete and 0 interrupted iterations
default   [  53% ] 23/30 VUs  1m19.0s/2m30.0s

running (1m19.9s), 23/30 VUs, 6090 complete and 0 interrupted iterations
default   [  53% ] 23/30 VUs  1m20.0s/2m30.0s

running (1m20.9s), 23/30 VUs, 6186 complete and 0 interrupted iterations
default   [  54% ] 23/30 VUs  1m21.0s/2m30.0s

running (1m21.9s), 23/30 VUs, 6261 complete and 0 interrupted iterations
default   [  55% ] 23/30 VUs  1m22.0s/2m30.0s

running (1m22.9s), 23/30 VUs, 6326 complete and 0 interrupted iterations
default   [  55% ] 23/30 VUs  1m23.0s/2m30.0s

running (1m23.9s), 23/30 VUs, 6405 complete and 0 interrupted iterations
default   [  56% ] 23/30 VUs  1m24.0s/2m30.0s

running (1m24.9s), 24/30 VUs, 6510 complete and 0 interrupted iterations
default   [  57% ] 24/30 VUs  1m25.0s/2m30.0s

running (1m25.9s), 24/30 VUs, 6625 complete and 0 interrupted iterations
default   [  57% ] 24/30 VUs  1m26.0s/2m30.0s

running (1m26.9s), 24/30 VUs, 6758 complete and 0 interrupted iterations
default   [  58% ] 24/30 VUs  1m27.0s/2m30.0s

running (1m27.9s), 24/30 VUs, 6840 complete and 0 interrupted iterations
default   [  59% ] 24/30 VUs  1m28.0s/2m30.0s

running (1m28.9s), 24/30 VUs, 6956 complete and 0 interrupted iterations
default   [  59% ] 24/30 VUs  1m29.0s/2m30.0s

running (1m29.9s), 24/30 VUs, 7024 complete and 0 interrupted iterations
default   [  60% ] 24/30 VUs  1m30.0s/2m30.0s

running (1m30.9s), 25/30 VUs, 7152 complete and 0 interrupted iterations
default   [  61% ] 25/30 VUs  1m31.0s/2m30.0s

running (1m31.9s), 25/30 VUs, 7254 complete and 0 interrupted iterations
default   [  61% ] 25/30 VUs  1m32.0s/2m30.0s

running (1m32.9s), 25/30 VUs, 7349 complete and 0 interrupted iterations
default   [  62% ] 25/30 VUs  1m33.0s/2m30.0s

running (1m33.9s), 25/30 VUs, 7429 complete and 0 interrupted iterations
default   [  63% ] 25/30 VUs  1m34.0s/2m30.0s

running (1m34.9s), 25/30 VUs, 7510 complete and 0 interrupted iterations
default   [  63% ] 25/30 VUs  1m35.0s/2m30.0s

running (1m35.9s), 25/30 VUs, 7621 complete and 0 interrupted iterations
default   [  64% ] 25/30 VUs  1m36.0s/2m30.0s

running (1m36.9s), 26/30 VUs, 7682 complete and 0 interrupted iterations
default   [  65% ] 26/30 VUs  1m37.0s/2m30.0s

running (1m37.9s), 26/30 VUs, 7783 complete and 0 interrupted iterations
default   [  65% ] 26/30 VUs  1m38.0s/2m30.0s

running (1m38.9s), 26/30 VUs, 7880 complete and 0 interrupted iterations
default   [  66% ] 26/30 VUs  1m39.0s/2m30.0s

running (1m39.9s), 26/30 VUs, 7940 complete and 0 interrupted iterations
default   [  67% ] 26/30 VUs  1m40.0s/2m30.0s

running (1m40.9s), 26/30 VUs, 8041 complete and 0 interrupted iterations
default   [  67% ] 26/30 VUs  1m41.0s/2m30.0s

running (1m41.9s), 26/30 VUs, 8139 complete and 0 interrupted iterations
default   [  68% ] 26/30 VUs  1m42.0s/2m30.0s

running (1m42.9s), 27/30 VUs, 8243 complete and 0 interrupted iterations
default   [  69% ] 27/30 VUs  1m43.0s/2m30.0s

running (1m43.9s), 27/30 VUs, 8298 complete and 0 interrupted iterations
default   [  69% ] 27/30 VUs  1m44.0s/2m30.0s

running (1m44.9s), 27/30 VUs, 8421 complete and 0 interrupted iterations
default   [  70% ] 27/30 VUs  1m45.0s/2m30.0s

running (1m45.9s), 27/30 VUs, 8501 complete and 0 interrupted iterations
default   [  71% ] 27/30 VUs  1m46.0s/2m30.0s

running (1m46.9s), 27/30 VUs, 8612 complete and 0 interrupted iterations
default   [  71% ] 27/30 VUs  1m47.0s/2m30.0s

running (1m47.9s), 27/30 VUs, 8737 complete and 0 interrupted iterations
default   [  72% ] 27/30 VUs  1m48.0s/2m30.0s

running (1m48.9s), 28/30 VUs, 8845 complete and 0 interrupted iterations
default   [  73% ] 28/30 VUs  1m49.0s/2m30.0s

running (1m49.9s), 28/30 VUs, 8930 complete and 0 interrupted iterations
default   [  73% ] 28/30 VUs  1m50.0s/2m30.0s

running (1m50.9s), 28/30 VUs, 9134 complete and 0 interrupted iterations
default   [  74% ] 28/30 VUs  1m51.0s/2m30.0s

running (1m51.9s), 28/30 VUs, 9227 complete and 0 interrupted iterations
default   [  75% ] 28/30 VUs  1m52.0s/2m30.0s

running (1m52.9s), 28/30 VUs, 9305 complete and 0 interrupted iterations
default   [  75% ] 28/30 VUs  1m53.0s/2m30.0s

running (1m53.9s), 28/30 VUs, 9392 complete and 0 interrupted iterations
default   [  76% ] 28/30 VUs  1m54.0s/2m30.0s

running (1m54.9s), 29/30 VUs, 9469 complete and 0 interrupted iterations
default   [  77% ] 29/30 VUs  1m55.0s/2m30.0s

running (1m55.9s), 29/30 VUs, 9562 complete and 0 interrupted iterations
default   [  77% ] 29/30 VUs  1m56.0s/2m30.0s

running (1m56.9s), 29/30 VUs, 9675 complete and 0 interrupted iterations
default   [  78% ] 29/30 VUs  1m57.0s/2m30.0s

running (1m57.9s), 29/30 VUs, 9773 complete and 0 interrupted iterations
default   [  79% ] 29/30 VUs  1m58.0s/2m30.0s

running (1m58.9s), 29/30 VUs, 9850 complete and 0 interrupted iterations
default   [  79% ] 29/30 VUs  1m59.0s/2m30.0s

running (1m59.9s), 29/30 VUs, 9955 complete and 0 interrupted iterations
default   [  80% ] 29/30 VUs  2m00.0s/2m30.0s

running (2m00.9s), 30/30 VUs, 10075 complete and 0 interrupted iterations
default   [  81% ] 30/30 VUs  2m01.0s/2m30.0s

running (2m01.9s), 29/30 VUs, 10155 complete and 0 interrupted iterations
default   [  81% ] 29/30 VUs  2m02.0s/2m30.0s

running (2m02.9s), 28/30 VUs, 10266 complete and 0 interrupted iterations
default   [  82% ] 28/30 VUs  2m03.0s/2m30.0s

running (2m03.9s), 27/30 VUs, 10382 complete and 0 interrupted iterations
default   [  83% ] 27/30 VUs  2m04.0s/2m30.0s

running (2m04.9s), 26/30 VUs, 10510 complete and 0 interrupted iterations
default   [  83% ] 26/30 VUs  2m05.0s/2m30.0s

running (2m05.9s), 25/30 VUs, 10619 complete and 0 interrupted iterations
default   [  84% ] 25/30 VUs  2m06.0s/2m30.0s

running (2m06.9s), 24/30 VUs, 10723 complete and 0 interrupted iterations
default   [  85% ] 24/30 VUs  2m07.0s/2m30.0s

running (2m07.9s), 23/30 VUs, 10827 complete and 0 interrupted iterations
default   [  85% ] 23/30 VUs  2m08.0s/2m30.0s

running (2m08.9s), 22/30 VUs, 10916 complete and 0 interrupted iterations
default   [  86% ] 22/30 VUs  2m09.0s/2m30.0s

running (2m09.9s), 21/30 VUs, 11008 complete and 0 interrupted iterations
default   [  87% ] 21/30 VUs  2m10.0s/2m30.0s

running (2m10.9s), 20/30 VUs, 11105 complete and 0 interrupted iterations
default   [  87% ] 20/30 VUs  2m11.0s/2m30.0s

running (2m11.9s), 19/30 VUs, 11193 complete and 0 interrupted iterations
default   [  88% ] 19/30 VUs  2m12.0s/2m30.0s

running (2m12.9s), 18/30 VUs, 11294 complete and 0 interrupted iterations
default   [  89% ] 18/30 VUs  2m13.0s/2m30.0s

running (2m13.9s), 17/30 VUs, 11383 complete and 0 interrupted iterations
default   [  89% ] 17/30 VUs  2m14.0s/2m30.0s

running (2m14.9s), 16/30 VUs, 11478 complete and 0 interrupted iterations
default   [  90% ] 16/30 VUs  2m15.0s/2m30.0s

running (2m15.9s), 15/30 VUs, 11600 complete and 0 interrupted iterations
default   [  91% ] 15/30 VUs  2m16.0s/2m30.0s

running (2m16.9s), 14/30 VUs, 11691 complete and 0 interrupted iterations
default   [  91% ] 14/30 VUs  2m17.0s/2m30.0s

running (2m17.9s), 13/30 VUs, 11795 complete and 0 interrupted iterations
default   [  92% ] 13/30 VUs  2m18.0s/2m30.0s

running (2m18.9s), 12/30 VUs, 11900 complete and 0 interrupted iterations
default   [  93% ] 12/30 VUs  2m19.0s/2m30.0s

running (2m19.9s), 11/30 VUs, 11985 complete and 0 interrupted iterations
default   [  93% ] 11/30 VUs  2m20.0s/2m30.0s

running (2m20.9s), 10/30 VUs, 12060 complete and 0 interrupted iterations
default   [  94% ] 10/30 VUs  2m21.0s/2m30.0s

running (2m21.9s), 09/30 VUs, 12141 complete and 0 interrupted iterations
default   [  95% ] 09/30 VUs  2m22.0s/2m30.0s

running (2m22.9s), 08/30 VUs, 12215 complete and 0 interrupted iterations
default   [  95% ] 08/30 VUs  2m23.0s/2m30.0s

running (2m23.9s), 07/30 VUs, 12279 complete and 0 interrupted iterations
default   [  96% ] 07/30 VUs  2m24.0s/2m30.0s

running (2m24.9s), 06/30 VUs, 12335 complete and 0 interrupted iterations
default   [  97% ] 06/30 VUs  2m25.0s/2m30.0s

running (2m25.9s), 05/30 VUs, 12385 complete and 0 interrupted iterations
default   [  97% ] 05/30 VUs  2m26.0s/2m30.0s

running (2m26.9s), 04/30 VUs, 12423 complete and 0 interrupted iterations
default   [  98% ] 04/30 VUs  2m27.0s/2m30.0s

running (2m28.0s), 03/30 VUs, 12453 complete and 0 interrupted iterations
default   [  99% ] 03/30 VUs  2m28.0s/2m30.0s

running (2m28.9s), 02/30 VUs, 12473 complete and 0 interrupted iterations
default   [  99% ] 02/30 VUs  2m29.0s/2m30.0s

running (2m29.9s), 01/30 VUs, 12484 complete and 0 interrupted iterations
default   [ 100% ] 01/30 VUs  2m30.0s/2m30.0s

     data_received..................: 1.5 MB 9.8 kB/s
     data_sent......................: 1.3 MB 9.0 kB/s
     http_req_blocked...............: avg=76.34µs  min=5.9µs    med=24.69µs  max=31.97ms p(90)=37.67µs  p(95)=74.56µs 
     http_req_connecting............: avg=2.65µs   min=0s       med=0s       max=5.08ms  p(90)=0s       p(95)=0s      
   ✓ http_req_duration..............: avg=96.59ms  min=232.15µs med=69.18ms  max=1.28s   p(90)=285.57ms p(95)=395.77ms
       { expected_response:true }...: avg=96.59ms  min=232.15µs med=69.18ms  max=1.28s   p(90)=285.57ms p(95)=395.77ms
   ✓ http_req_failed................: 0.00%  ✓ 0         ✗ 12485
     http_req_receiving.............: avg=543.77µs min=25.23µs  med=168.63µs max=39.54ms p(90)=652.15µs p(95)=1.96ms  
     http_req_sending...............: avg=220.58µs min=11.3µs   med=61.85µs  max=74.52ms p(90)=164.26µs p(95)=493.92µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=95.82ms  min=159.96µs med=68.7ms   max=1.28s   p(90)=285.18ms p(95)=395.4ms 
     http_reqs......................: 12485  83.232743/s
     iteration_duration.............: avg=201.82ms min=100.39ms med=174.34ms max=1.39s   p(90)=390.58ms p(95)=502.43ms
     iterations.....................: 12485  83.232743/s
     vus............................: 1      min=1       max=30 
     vus_max........................: 30     min=30      max=30 


running (2m30.0s), 00/30 VUs, 12485 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/30 VUs  2m30s